master/cases/halle/2D/spray_4/ico_spray.coarseMesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1750";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
11750
(
(0.0254432 -2.45828e-11 6.86605)
(0.0218398 -3.19125e-11 7.62295)
(0.0282755 -2.20055e-11 7.92943)
(0.0244006 -1.02258e-11 8.01659)
(0.0190781 -7.75975e-11 8.03568)
(0.0141111 -1.17509e-11 8.03904)
(0.0096208 -6.16341e-12 8.03949)
(0.00553072 -3.56077e-11 8.03951)
...
)
;

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        flowRate        0.000319444;
        value           uniform (-0 -0 7.93335);
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
