master/cases/halle/2D/spray_4/ico_spray.coarseMesh/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1750";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
11750
(
7.47144e-05
2.2729e-05
5.09948e-06
1.494e-06
2.3186e-06
1.08273e-05
3.08953e-05
4.55216e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 5.1963e-05;
    }
    walls
    {
        type            nutWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
245
(
4.40953e-06
5.11896e-06
4.84476e-06
4.59888e-06
4.48203e-06
4.4429e-06
4.43759e-06
4.44493e-06
...
)
;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
110
(
0.00152802
0.00152828
0.00152881
0.00152956
0.00153054
0.00153176
0.0015332
0.00153488
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
