master/cases/halle/2D/spray_4/ico_spray.coarseMesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho PCG
    {
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0;
    };
    addedMass PCG
    {
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0;
    };
   U PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    };
    p PCG
    {
        preconditioner   DIC;
        tolerance        1e-09;
        relTol           0;
    };
    pFinal PCG
    {
        preconditioner   DIC;
        tolerance        1e-09;
        relTol           0;
    };
    Yi PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    };
    T PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
    hs PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    };
    k PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0;
    };
    epsilon PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    };
}

PISO
{
    nCorrectors     5;
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
